In [2]:
import pandas as pd

In [5]:
df = pd.read_csv('DataCleaningDataset.csv', sep=';')
df.head()

,NAME,CITY,COUNTRY,HEIGHT,WEIGHT,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT
0,Adi Dako,LISBON,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [8]:
df.columns

Index(['NAME', 'CITY', 'COUNTRY', 'HEIGHT', 'WEIGHT', 'ACCOUNT A', 'ACCOUNT B',
       'TOTAL ACCOUNT'],
      dtype='object')

In [6]:
df.shape

(8, 8)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   NAME           8 non-null      object
 1   CITY           8 non-null      object
 2   COUNTRY        8 non-null      object
 3   HEIGHT         8 non-null      int64
 4   WEIGHT         7 non-null      float64
 5   ACCOUNT A      7 non-null      float64
 6   ACCOUNT B      8 non-null      int64
 7   TOTAL ACCOUNT  8 non-null      int64
dtypes: float64(2), int64(3), object(3)
memory usage: 640.0+ bytes

In [9]:
df2 = pd.read_csv('data/vgsales.csv')
df2.columns

Index(['Rank', 'Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')